{
  "id": 9,
  "name": "Mesa Storm Drains - Decoy Haven",
  "type": "Haven",
  "summary": "Elaborate trap disguised as Alistaire's primary haven in Mesa's massive storm drain system, maintained to misdirect attention from The Warrens.",
  "description": "Located in the exact center of Mesa within the city's extensive storm drain network (some tunnels over 10 feet tall), this decoy haven appears to be a fully functional Nosferatu residence spread across four furnished rooms carved into side passages off the main drainage system. Room 1 (entrance chamber) contains a makeshift sleeping area with bedroll, personal effects, and occult paraphernalia suggesting regular habitation. Room 2 (living space) has scavenged furniture - chairs, small table, storage crates, Coleman lanterns, and the critical pressure plate hidden under a loose piece of flooring that triggers the trap. Room 3 (storage) contains canned goods, bottled water, spare clothing, and various survival supplies. Room 4 (sanctum) features more personal items, journals (carefully planted false information), and a locked chest with minor valuables. All four rooms are genuinely livable - a Nosferatu could move in tomorrow and be comfortable. The trap activates when someone reaches Room 2: the pressure plate (or Betty's remote trigger if rats alert her) drops heavy military-grade steel gates at both ends of the room sequence, creating an inescapable cage. The surrounding storm drain tunnels are patrolled by two dozen rats (Alistaire's Animalism 5 network reporting any intrusion) and five javelina that roam the passages serving as both alarm system and deterrent. The entire setup is maintained regularly by Earl, Dale, and occasionally Terry to ensure it remains convincing. Water flow, drainage patterns, and seasonal flooding are all accounted for in the room placement - they're elevated enough to avoid normal water levels but low enough to seem practical.",
  "notes": "Elaborate non-lethal trap designed to catch anyone investigating 'Nosferatu Primogen's haven.' The entire Kindred community believes Alistaire lives here - only his inner circle knows about The Warrens. Pressure plate in Room 2 triggers remote-controlled steel gates (repurposed military equipment from The Warrens stockpile) that drop at entrance and exit, trapping intruder in cage. Gates can also be manually triggered by Betty if rats report intrusion before pressure plate activates. Two dozen rats patrol constantly via Animalism - report directly to Alistaire when anyone enters. Five javelina (dangerous desert peccaries) roam outer tunnels as mobile deterrent and alarm. All rooms genuinely furnished and supplied - completely functional as backup haven if needed. Maintained regularly to keep dust levels, supplies, and 'lived-in' appearance correct. Has never been triggered yet (as of 1994) but ready for any PC who gets bright idea to sneak into 'Nosferatu haven.' Purpose: protect The Warrens location, gather intelligence on who's snooping, capture intruders for interrogation. Storm drain system connects to city infrastructure but this section carefully chosen for controllable access points.",
  "status": "Active",
  "status_notes": "Maintained as active decoy. Regularly serviced to appear lived-in. Trap systems tested monthly.",
  "district": "Central Mesa",
  "address": "Storm drain system, exact center of Mesa (accessible from multiple surface grates)",
  "latitude": 33.41500000,
  "longitude": -111.83100000,
  "owner_type": "Individual",
  "owner_notes": "Secretly maintained by Alistaire as misdirection. Mesa city government unaware of habitation. Most Kindred believe this is Alistaire's true haven (exactly as intended).",
  "faction": "Camarilla",
  "access_control": "Public",
  "access_notes": "Storm drains are 'public' infrastructure but isolated and dangerous. Entry requires navigating Mesa's storm drain system - multiple access points from surface grates. No obvious security to avoid suspicion - appears like secret haven trying to stay hidden. The trap only activates once intruder is deep inside (Room 2), suggesting confidence they won't be discovered.",
  "security_level": 7,
  "security_locks": 0,
  "security_alarms": 0,
  "security_guards": 1,
  "security_hidden_entrance": 1,
  "security_sunlight_protected": 1,
  "security_warding_rituals": 0,
  "security_cameras": 0,
  "security_reinforced": 1,
  "security_notes": "Deliberately minimal visible security to maintain illusion. Real security: Two dozen rats (Animalism network) throughout surrounding tunnels report any intrusion immediately to Alistaire. Five javelina patrol outer storm drain passages - dangerous territorial animals serve as organic alarm system and deterrent. Hidden pressure plate in Room 2 triggers trap. Remote-controlled military-grade steel gates (repurposed from The Warrens stockpile) drop at both ends when triggered, creating inescapable cage. Betty monitors via rat reports and can manually trigger gates. Storm drain location provides natural sunlight protection. Reinforced rooms elevated above normal water flow. Multiple escape routes for authorized personnel (Alistaire via Obfuscate, maintenance crew knows safe paths). Trap is non-lethal - designed to capture for interrogation, not kill.",
  "utility_blood_storage": 1,
  "utility_computers": 0,
  "utility_library": 0,
  "utility_medical": 0,
  "utility_workshop": 0,
  "utility_hidden_caches": 1,
  "utility_armory": 0,
  "utility_communications": 0,
  "utility_notes": "Blood storage: small cooler with animal blood (maintained as part of illusion). Hidden caches: planted false information in journals, minor valuables in locked chest to appear genuine, emergency supplies scattered throughout rooms. All utilities are basic but functional - this place could serve as emergency backup haven if The Warrens ever compromised. No advanced technology to avoid suspicion.",
  "social_features": "Appears to be solitary haven for reclusive Nosferatu Primogen who values privacy. No entertaining space, no common areas - reinforces image of Alistaire as isolated, powerful elder who lives alone in storm drains (classic Nosferatu stereotype). This is exactly what other Kindred expect to see.",
  "capacity": 2,
  "prestige_level": 0,
  "has_supernatural": 1,
  "node_points": 0,
  "node_type": "None",
  "ritual_space": "False ritual space in Room 4 to maintain illusion",
  "magical_protection": "Alistaire's Animalism 5 rat network provides constant surveillance and early warning. Javelina serve as organic guards. The trap itself is the primary protection - captures intruders rather than killing them.",
  "cursed_blessed": "The entire location is a blessing (protects The Warrens) and a curse (requires constant maintenance, risk of discovery if trap fails).",
  "parent_location_id": null,
  "relationship_type": "Decoy for The Warrens",
  "relationship_notes": "Deliberately maintained as false haven to protect The Warrens true location. Connected to Mesa storm drain infrastructure. Most Phoenix Kindred believe this is where Alistaire actually lives - they see his massive size and assume the huge storm drains are perfect for him. The misdirection has worked for 40 years.",
  "image": null,
  "created_at": "2025-01-11 00:00:00",
  "updated_at": "2025-01-11 00:00:00"
}