{
  "id": 8,
  "name": "The Warrens - Computer Room",
  "type": "Haven",
  "summary": "Level 1 high-tech nerve center where Core, Phreak, and Betty run Phoenix Nosferatu digital intelligence operations and Shrecknet hub.",
  "description": "The main computer room occupies a sprawling 40x60 foot space on Level 1 of The Warrens, carved from the original Army Air Corps facility with 12-foot reinforced concrete ceilings painted institutional gray. Multiple server racks line the walls, their LEDs blinking in darkness like mechanical constellations - including DEC Alpha AXP servers running Digital UNIX, Sun SPARCstation 20 workstations, and custom-built 486 DX2/66 systems for specialized tasks. The air maintains constant 68°F from industrial HVAC, filled with persistent hum of cooling fans, spinning platters, and the occasional chirp of dial-up modems. Three dual T1 lines (3.088 Mbps combined - expensive and rare for 1994) provide Internet connectivity and BBS access, routing through Cisco AGS+ routers with extensive firewall configurations. Fluorescent lights cast harsh white illumination across workstations arranged in rough horseshoe, with the main systems - Unix servers and core networking equipment - dominating center and left side. On the far right, separated by 15 feet and surrounded by copper mesh Faraday cage grounding connected to building's foundation, sits Phreak's shielded workstation (necessary due to his EM field that causes AM radio static and compass deflection within 10 feet). Small break area in corner contains mini-fridge with animal blood from hill hunting, unused coffee maker from previous occupants, and ratty couch where Betty crashes during marathon coding sessions. The room connects to Level 1 common areas and has its own climate-controlled cable management running throughout walls and ceiling. Multiple phone lines enter through armored conduits, and hidden cameras monitor the single entrance. Alistaire's rats patrol here constantly, comfortable around the humming equipment.",
  "notes": "Operational since 1988-1989 when Core and Phreak arrived, massively upgraded when Betty joined 1993. Core builds deep infrastructure (kernel work, protocol development), Phreak handles penetration testing and security from his shielded corner, Betty coordinates operations and interfaces with outside world. All three spend most waking hours here. Minor philosophical debates about systems architecture vs security approach happen regularly but remain professional. Equipment represents cutting-edge 1994 technology: DEC Alpha servers for computation, Sun workstations for development, multiple USRobotics Courier HST modems (28.8k), early Internet connectivity, custom BBS software for Shrecknet nodes, packet sniffers, war-dialing systems, and extensive hacking/security tools. The Faraday cage around Phreak's station includes copper mesh walls and ceiling with proper RF grounding - prevents his EM field (causes radio static, electronic glitches) from corrupting data on main systems.",
  "status": "Active",
  "status_notes": "Peak operational capacity. Running 24/7 operations with rotating monitoring schedule among the three residents.",
  "district": "South Phoenix / South Mountain Area",
  "address": "Level 1, The Warrens (classified location)",
  "latitude": 33.30000000,
  "longitude": -112.00000000,
  "owner_type": "Clan",
  "owner_notes": "Part of The Warrens complex owned by Alistaire. Computer operations managed by Betty (security chief) with Core and Phreak as technical specialists.",
  "faction": "Camarilla",
  "access_control": "Restricted",
  "access_notes": "Primary access limited to Core, Phreak, and Betty who work here constantly. Alistaire has full access but rarely enters (prefers reports). Terry occasionally visits but doesn't understand the technology. Earl and Dale enter only for maintenance/cleaning when room is unoccupied. Violet visits occasionally but must be escorted and cannot touch systems. Single entrance from Level 1 corridor with electronic lock and camera surveillance.",
  "security_level": 9,
  "security_locks": 1,
  "security_alarms": 1,
  "security_guards": 0,
  "security_hidden_entrance": 0,
  "security_sunlight_protected": 1,
  "security_warding_rituals": 0,
  "security_cameras": 1,
  "security_reinforced": 1,
  "security_notes": "Electronic lock on entrance controlled by Betty's security systems. Hidden cameras monitor doorway and interior. Rats patrol constantly and report to Alistaire. All data encrypted. Physical security inherits from The Warrens overall (Level 1 of underground fortress). Fire suppression systems for electronics. Backup power systems ensure no data loss. Phreak's Faraday cage prevents his EM interference and provides additional shielding. Equipment physically secured to prevent theft. No windows, completely underground and sunlight-protected.",
  "utility_blood_storage": 1,
  "utility_computers": 1,
  "utility_library": 1,
  "utility_medical": 0,
  "utility_workshop": 1,
  "utility_hidden_caches": 1,
  "utility_armory": 0,
  "utility_communications": 1,
  "utility_notes": "Blood storage: mini-fridge with animal blood for feeding breaks. Computers: extensive - see main description. Library: technical documentation everywhere - Unix manuals, RFC protocol specs, networking guides, hacking zines (2600, Phrack), security research papers, handwritten notes from years of research. Workshop: electronics repair bench with soldering equipment, oscilloscope, multimeter, component storage - used for hardware hacking and equipment maintenance. Hidden caches: backup storage media, encrypted data archives, emergency equipment. Communications: three T1 lines, dozens of phone lines, modems, routers, switches, BBS systems, Shrecknet nodes, encrypted channels, early Internet email, IRC access.",
  "social_features": "Not social space - purely functional workspace. The 'break area' couch serves as crash space during marathon debugging sessions. Brainstorming happens organically when someone has a question - mostly quiet work per Core's preference, but can turn into intense technical discussions. No entertaining or meetings here - that happens in common areas. This is where the digital revolution happens in silence and humming servers.",
  "capacity": 10,
  "prestige_level": 0,
  "has_supernatural": 1,
  "node_points": 5,
  "node_type": "Shrecknet Hub Node",
  "ritual_space": "None - purely technological",
  "magical_protection": "Alistaire's rat surveillance throughout room. Phreak's EM field creates interference with certain supernatural detection (unintentional side effect).",
  "cursed_blessed": "Phreak's EM field is both - blessing for interference, curse requiring shielding. The knowledge stored here is immense power.",
  "parent_location_id": 7,
  "relationship_type": "Sub-location",
  "relationship_notes": "Located on Level 1 of The Warrens bunker complex. Connected to common areas, access tunnels, and other Level 1 facilities. Power and climate control shared with complex infrastructure.",
  "image": null,
  "created_at": "2025-01-11 00:00:00",
  "updated_at": "2025-01-11 00:00:00"
}