{
  "id": 7,
  "name": "The Warrens",
  "type": "Haven",
  "summary": "Massive decommissioned WWII-era Army Air Corps bunker complex serving as Nosferatu Primogen Alistaire's primary haven and the nerve center of Phoenix Nosferatu operations.",
  "description": "The Warrens is a three-level underground bunker complex built during the WWII buildup as a secret Army Air Corps experimental facility tasked with developing innovative aircraft spotting methods. Decommissioned after the Korean Conflict in 1953, it was officially scheduled for demolition but Alistaire manipulated paperwork through bureaucratic influence to make the Air Force believe it was destroyed. The facility spans approximately 15,000 square feet across three descending levels, all reinforced with military-grade concrete and steel. Level 1 contains the main computer room, common areas, and access tunnels connecting to the Phoenix sewer system. Level 2 houses private quarters for residents (Alistaire, Terry, Betty, Core, Phreak) and the ghouls (Earl and Dale). Level 3 contains storage, maintenance systems, the animal feeding area for hunting returns from nearby hills, and Alistaire's private sanctum. The complex maintains perfect climate control at 68°F year-round through original military HVAC systems maintained by the ghoul custodians. Multiple entry points exist: the main entrance with remote-controlled reinforced doors (garage-door style), emergency exits hidden in the surrounding area, and sewer connections that lead to various parts of the Phoenix underground. The entire facility is completely sunlight-protected and maintains the institutional gray paint and utilitarian aesthetic of its 1940s military origins. Alistaire's rat network (Animalism 5) provides constant organic surveillance throughout all levels, while modern camera systems installed by Betty add electronic security. The surrounding area is kept clear of homeless and trespassers by Earl and Dale's regular patrols.",
  "notes": "Acquired 1954 through bureaucratic manipulation - altered Air Force records to show 'demolished'. Maintained through Influence backgrounds (controlling surrounding area). Original purpose: experimental aircraft spotting program that accomplished little. Has housed Alistaire since 1954 (40 years). Terry joined 1952. Core and Phreak arrived 1988-1989. Betty embraced 1993. Current residents: 5 Nosferatu (Alistaire, Terry, Betty, Core, Phreak) and 2 ghouls (Earl, Dale). Serves as Phoenix Nosferatu information hub and Shrecknet node. Connected to wider sewer system but all access points heavily secured. Most other Kindred believe Alistaire lives in Mesa storm drains (deliberate misdirection).",
  "status": "Active",
  "status_notes": "Operational since 1954. Continuously maintained and upgraded. Currently at peak operational capacity with full digital infrastructure.",
  "district": "South Phoenix / South Mountain Area",
  "address": "Classified former military facility - officially 'demolished' 1954",
  "latitude": 33.30000000,
  "longitude": -112.00000000,
  "owner_type": "Individual",
  "owner_notes": "Owned and controlled by Alistaire (8th generation Nosferatu Primogen). Acquired through bureaucratic manipulation and maintained through Influence backgrounds. One of the oldest Kindred in Phoenix (embraced 1833 Venice, arrived Phoenix 1950-1952).",
  "faction": "Camarilla",
  "access_control": "Restricted",
  "access_notes": "Extremely restricted access. Only 7 individuals permitted: Alistaire (owner/Primogen), Terry (childe, scout), Betty (childe, security chief), Dennis 'Core' Barsley (systems programmer), Kevin 'Phreak' Jamison (security/penetration), Earl (ghoul custodian), Dale (ghoul custodian). Violet occasionally visits but must be escorted and cannot access all levels. Remote-controlled doors require authorization codes. Biometric systems for ghouls. Alistaire uses Obfuscate to enter/exit. Multiple redundant security layers on each level.",
  "security_level": 10,
  "security_locks": 1,
  "security_alarms": 1,
  "security_guards": 1,
  "security_hidden_entrance": 1,
  "security_sunlight_protected": 1,
  "security_warding_rituals": 0,
  "security_cameras": 1,
  "security_reinforced": 1,
  "security_notes": "Maximum security fortress. Military-grade reinforced concrete/steel from WWII construction. Three levels underground. Multiple hidden entrances. Remote-controlled reinforced doors (garage-style, military-grade). Sewer connections secured with multiple checkpoints. Extensive camera network (Betty's security systems). Alistaire's Animalism 5 rat network provides constant organic surveillance across all three levels - rats report any intrusion immediately. Earl and Dale patrol surrounding area daily, clear homeless, maintain perimeter. Biometric access for ghouls. Obfuscate-recognition for Nosferatu residents. Emergency lockdown protocols on all levels. Phreak's EM field provides unintentional interference with some supernatural detection. All utilities self-contained and redundant. Decoy haven maintained in Mesa storm drains to misdirect attention.",
  "utility_blood_storage": 1,
  "utility_computers": 1,
  "utility_library": 1,
  "utility_medical": 1,
  "utility_workshop": 1,
  "utility_hidden_caches": 1,
  "utility_armory": 1,
  "utility_communications": 1,
  "utility_notes": "Blood storage: multiple refrigeration units for animal blood from hill hunting, emergency human blood supplies. Computers: Level 1 main computer room - cutting-edge 1994 tech including DEC Alpha servers, Sun SPARC workstations, multiple high-speed modems, T1 Internet lines, Shrecknet hub nodes, custom BBS systems, extensive networking equipment. Library: Level 2 contains extensive technical documentation, Unix/networking manuals, hacking references, Nosferatu information archives, historical records. Medical: basic first aid and emergency supplies (mostly for ghouls). Workshop: Level 3 electronics repair, hardware hacking station (Phreak's tools), general maintenance equipment, HVAC system access. Hidden caches: throughout all three levels - emergency supplies, backup data storage, weapons. Armory: Level 3 contains weapons storage (mostly for ghoul security, Alistaire rarely needs them). Communications: Multiple redundant phone lines, T1 Internet connection, encrypted channels, Shrecknet network, connection to wider Nosferatu intelligence network, early email/BBS systems.",
  "social_features": "Not designed for socializing or entertaining - purely functional operations center. Weekly Nosferatu meetings held in Level 1 common area (usually brief per Alistaire's preference). Informal brainstorming sessions happen in computer room when technical questions arise. Level 2 private quarters allow residents personal space. No Elysium functions or formal gatherings. Occasional visits from Violet for information exchange. Terry reports findings from his scouting. Atmosphere is professional, focused, quiet - this is a workplace and haven, not a social venue.",
  "capacity": 20,
  "prestige_level": 0,
  "has_supernatural": 1,
  "node_points": 5,
  "node_type": "Shrecknet Major Hub",
  "ritual_space": "None - Nosferatu don't use ritual magic, focus is technological/information-based",
  "magical_protection": "Alistaire's Animalism 5 rat network provides constant supernatural surveillance - dozens of rats throughout all three levels report any intrusion. Phreak's electromagnetic field creates unintentional interference with certain supernatural detection methods. The sheer isolation and secrecy serve as primary magical protection - very few know this place exists.",
  "cursed_blessed": "The facility's very existence is a kind of blessing - perfect hidden fortress for information operations. Phreak's EM field is both blessing (interferes with detection) and curse (requires shielding from sensitive equipment).",
  "parent_location_id": null,
  "relationship_type": "Complex with sub-locations",
  "relationship_notes": "Parent location for multiple sub-locations including: Computer Room (Level 1), Alistaire's private sanctum (Level 3), Terry's quarters (Level 2), Betty's quarters (Level 2), Core's quarters (Level 2), Phreak's quarters (Level 2), Earl and Dale's quarters (Level 2), maintenance spaces (Level 3), animal feeding area (Level 3), storage areas (Level 3), common areas (Level 1), sewer connection tunnels (Level 1), emergency exits (various levels). Also maintains false decoy haven in Mesa storm drains as misdirection.",
  "image": null,
  "created_at": "2025-01-11 00:00:00",
  "updated_at": "2025-01-11 00:00:00"
}